In [2]:
import pandas as pd

In [4]:
##Series
##A Pandas is a one-dimension array-like object that can hold any data type
import pandas as pd
data=[1,2,3,4,5]
series=pd.Series(data)
print("Series \n",series)
print(type(series))

Series
 0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.Series'>

In [5]:
##Create a series from dictionary
data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [2]:
import pandas as pd
data=[10,20,30]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    30
dtype: int64

In [3]:
## Dataframe
##reate a Dataframe from a dictionary of list
import pandas as pd
data = {
    "Name": ["Alice", "Bob", "Charlie"],
    "Age": [25, 30, 35],
    "City": ["Delhi", "Mumbai", "Kolkata"]
}
df = pd.DataFrame(data)
print(df)
print(type(df))

      Name  Age     City
0    Alice   25    Delhi
1      Bob   30   Mumbai
2  Charlie   35  Kolkata
<class 'pandas.DataFrame'>

In [4]:
##conver datafram to array
import numpy as np
np.array(df)

array([['Alice', 25, 'Delhi'],
       ['Bob', 30, 'Mumbai'],
       ['Charlie', 35, 'Kolkata']], dtype=object)

In [5]:
##Create a Data Frame from a List of Dictionaries
import pandas as pd

data = [
    {"Name": "Alice", "Age": 25, "City": "Delhi"},
    {"Name": "Bob", "Age": 30, "City": "Mumbai"},
    {"Name": "Charlie", "Age": 35, "City": "Kolkata"}
]

df = pd.DataFrame(data)
print(df)

      Name  Age     City
0    Alice   25    Delhi
1      Bob   30   Mumbai
2  Charlie   35  Kolkata

In [ ]:
# df=pd.read_csv('annual-record.csv')
# df.head(5)

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
0,2024,Level 1,99999,All industries,Dollars (millions),H01,Total income,Financial performance,979594,ANZSIC06 divisions A-S (excluding classes K633...
1,2024,Level 1,99999,All industries,Dollars (millions),H04,"Sales, government funding, grants and subsidies",Financial performance,838626,ANZSIC06 divisions A-S (excluding classes K633...
2,2024,Level 1,99999,All industries,Dollars (millions),H05,"Interest, dividends and donations",Financial performance,112188,ANZSIC06 divisions A-S (excluding classes K633...
3,2024,Level 1,99999,All industries,Dollars (millions),H07,Non-operating income,Financial performance,28781,ANZSIC06 divisions A-S (excluding classes K633...
4,2024,Level 1,99999,All industries,Dollars (millions),H08,Total expenditure,Financial performance,856960,ANZSIC06 divisions A-S (excluding classes K633...

In [14]:
##Accessing data from dataframe
##Create a Data Frame from a List of Dictionaries
import pandas as pd

data = [
    {"Name": "Alice", "Age": 25, "City": "Delhi"},
    {"Name": "Bob", "Age": 30, "City": "Mumbai"},
    {"Name": "Charlie", "Age": 35, "City": "Kolkata"}
]

df = pd.DataFrame(data)
df['Name']
df.iloc[0]

Name    Alice
Age        25
City    Delhi
Name: 0, dtype: object

In [17]:
##Accessing a specific element
print(df.at[1,'Age'])

30

In [18]:
##Accessing a specified element using iat
df.iat[2,2]

'Kolkata'

In [ ]:
##Data Manupulation with DataFrames
df['Salary']=[50000,60000,70000] ##adding a column
print(df)

      Name  Age     City  Salary
0    Alice   25    Delhi   50000
1      Bob   30   Mumbai   60000
2  Charlie   35  Kolkata   70000

In [22]:
##Remove a column
df.drop('Salary',axis=1,inplace =True)## 1 for colum and 0 for row
##inplace= True make the operation permanent

In [23]:
##Add age to column
df['Age']=df['Age']+1
df

      Name  Age     City
0    Alice   26    Delhi
1      Bob   31   Mumbai
2  Charlie   36  Kolkata

In [ ]:
##Display the datatype of eachcolumns
print("Data types:",df.dtypes)
##Describe the DataFramess
print(df.describe)
##Group by a colum and perform a aggretion
result = df.groupby("City")["Salary"].mean()
print(result)